## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_account.api_cloudwatch will be updated in-place
  ~ resource "aws_api_gateway_account" "api_cloudwatch" {
      ~ cloudwatch_role_arn = "arn:aws:iam::507252742351:role/a11y-tools-api-gateway-cloudwatch-role" -> "arn:aws:iam::507252742351:role/ApiGatewayCloudWatchRole"
        id                  = "api-gateway-account"
        # (1 unchanged attribute hidden)
    }

  # aws_flow_log.cloud_based_sensor must be replaced
-/+ resource "aws_flow_log" "cloud_based_sensor" {
      ~ arn                      = "arn:aws:ec2:ca-central-1:507252742351:vpc-flow-log/fl-0363762fb4ae1e2c1" -> (known after apply)
      ~ id                       = "fl-0363762fb4ae1e2c1" -> (known after apply)
      ~ log_destination          = "arn:aws:s3:::cbs-satellite-507252742351" -> "arn:aws:s3:::cbs-satellite-507252742351/vpc_flow_logs/" # forces replacement
      + log_group_name           = (known after apply)
        tags                     = {
            "CostCentre" = "scan-websites-production"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

      - destination_options {
          - file_format                = "plain-text" -> null
          - hive_compatible_partitions = false -> null
          - per_hour_partition         = false -> null
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.scan_websites_certificate"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.scan-websites"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.axe-core-urls"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.github-urls"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.body_exclusions"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.google_auth_uri"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["module.rds.aws_iam_policy.read_connection_string"]

28 tests, 8 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
